Revit 2027 API
BuiltInFailures.WallFailures.WallCutoutForInsertionFailure Property
 Can't cut wall for inserted objects
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallCutoutForInsertionFailure { get; }
Public Shared ReadOnly Property WallCutoutForInsertionFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallCutoutForInsertionFailure {
	FailureDefinitionId^ get ();
}
static member WallCutoutForInsertionFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace